# ----------------------------------------------------------------------------------------
# PROGRAMA: Números primos
# ----------------------------------------------------------------------------------------
# Descripción: Se debe determinar si un número es primo o no
# ----------------------------------------------------------------------------------------
# Autor: Juan Diego Camacho
# Version: 1.0
# [17.08.2021]
# ----------------------------------------------------------------------------------------
# IMPORTAR MODULOS

# ----------------------------------------------------------------------------------------
# VARIABLES GLOBALES Y PRE-CONDICIONES
# ----------------------------------------------------------------------------------------

compuesto = False # Variable booleana para determinar si el número es primo o no

a = input('\nIngrese el número que desee evaluar\nLuego presione Enter\n')

try:
    a = int(a)
except:
    print('Debe ingresar un número entero')

# ----------------------------------------------------------------------------------------
# POSTCONDICIONES
# ----------------------------------------------------------------------------------------


# ----------------------------------------------------------------------------------------
# PARAMETROS
# ----------------------------------------------------------------------------------------
# listar aqui los parámetros

if a > 1:
    for i in range(2, a):
        if(a % i) == 0:
            compuesto = True
            break

if compuesto:
    print("{} no es un número primo".format(a))
elif a == 1:
    print("1 no es un número primo ni compuesto")
else:
    print("{} sí es un número primo".format(a))


# ----------------------------------------------------------------------------------------
# end.
# ----------------------------------------------------------------------------------------